#

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark = SparkSession.builder.appName('Practice').getOrCreate()

23/07/10 07:02:57 WARN Utils: Your hostname, Benhards-MacBook-Pro.local resolves to a loopback address: 127.0.0.1; using 192.168.1.14 instead (on interface en0)
23/07/10 07:02:57 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/07/10 07:02:58 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/07/10 07:02:59 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/07/10 07:02:59 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [30]:
df_pyspark=spark.read.csv('data.csv', header = True, inferSchema=True)
df_pyspark.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Michael|  21|        10| 30000|
|  Karen|  22|         8|250000|
| Jessie|  20|         4| 20000|
|   Jean|  24|         3| 20000|
|   Paul|  21|         1|150000|
|  Jones|  23|         2|180000|
|   null|null|      null| 40000|
|   null|  34|        10|380000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [10]:
#Dropping columns
df_pyspark.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  21|        10| 30000|
|  22|         8|250000|
|  20|         4| 20000|
|  24|         3| 20000|
|  21|         1|150000|
|  23|         2|180000|
|null|      null| 40000|
|  34|        10|380000|
|  36|      null|  null|
+----+----------+------+

In [14]:
#Drop everything with a null record
df_pyspark.na.drop().show()
#all argument in how will drop record if all the column of a row is null
df_pyspark.na.drop(how ='all').show()
#Same as first one
df_pyspark.na.drop(how = 'any').show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Michael| 21|        10| 30000|
|  Karen| 22|         8|250000|
| Jessie| 20|         4| 20000|
|   Jean| 24|         3| 20000|
|   Paul| 21|         1|150000|
|  Jones| 23|         2|180000|
+-------+---+----------+------+

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Michael|  21|        10| 30000|
|  Karen|  22|         8|250000|
| Jessie|  20|         4| 20000|
|   Jean|  24|         3| 20000|
|   Paul|  21|         1|150000|
|  Jones|  23|         2|180000|
|   null|null|      null| 40000|
|   null|  34|        10|380000|
|   null|  36|      null|  null|
+-------+----+----------+------+

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Michael| 21|        10| 30000|
|  Karen| 22|         8|250000|
| Jessie| 20|         4| 20000|
|   Jean| 24|         3| 20000|
|   Paul| 21|         1|150000|
|  Jones| 23|         2|180000|
+-------+---+----------+------+

In [17]:
#Thresh is to deterimine the minimum amount of non-null value columns of a row before getting deleted
df_pyspark.na.drop(how = 'any', thresh =2).show()

df_pyspark.na.drop(how = 'any', thresh =1).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Michael| 21|        10| 30000|
|  Karen| 22|         8|250000|
| Jessie| 20|         4| 20000|
|   Jean| 24|         3| 20000|
|   Paul| 21|         1|150000|
|  Jones| 23|         2|180000|
|   null| 34|        10|380000|
+-------+---+----------+------+

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Michael|  21|        10| 30000|
|  Karen|  22|         8|250000|
| Jessie|  20|         4| 20000|
|   Jean|  24|         3| 20000|
|   Paul|  21|         1|150000|
|  Jones|  23|         2|180000|
|   null|null|      null| 40000|
|   null|  34|        10|380000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [20]:
#Subset argument will drop the argument's column if there is a null value in a row
df_pyspark.na.drop(how = 'any', subset=['Age']).show()
df_pyspark.na.drop(how = 'any', subset=['Experience']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Michael| 21|        10| 30000|
|  Karen| 22|         8|250000|
| Jessie| 20|         4| 20000|
|   Jean| 24|         3| 20000|
|   Paul| 21|         1|150000|
|  Jones| 23|         2|180000|
|   null| 34|        10|380000|
|   null| 36|      null|  null|
+-------+---+----------+------+

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Michael| 21|        10| 30000|
|  Karen| 22|         8|250000|
| Jessie| 20|         4| 20000|
|   Jean| 24|         3| 20000|
|   Paul| 21|         1|150000|
|  Jones| 23|         2|180000|
|   null| 34|        10|380000|
+-------+---+----------+------+

In [55]:
#The first argument is the new value to replace null with, the second argument is which column to do the replacement in
df_pyspark.na.fill('Missing Values',['Age','Experience']).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Michael|  21|        10| 30000|
|  Karen|  22|         8|250000|
| Jessie|  20|         4| 20000|
|   Jean|  24|         3| 20000|
|   Paul|  21|         1|150000|
|  Jones|  23|         2|180000|
|   null|null|      null| 40000|
|   null|  34|        10|380000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [41]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age', 'Experience', 'Salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','Experience','Salary']]
).setStrategy('mean')

In [42]:
#Add imputation columns to df
imputer.fit(df_pyspark).transform(df_pyspark).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Michael|  21|        10| 30000|         21|                10|         30000|
|  Karen|  22|         8|250000|         22|                 8|        250000|
| Jessie|  20|         4| 20000|         20|                 4|         20000|
|   Jean|  24|         3| 20000|         24|                 3|         20000|
|   Paul|  21|         1|150000|         21|                 1|        150000|
|  Jones|  23|         2|180000|         23|                 2|        180000|
|   null|null|      null| 40000|         25|                 5|         40000|
|   null|  34|        10|380000|         34|                10|        380000|
|   null|  36|      null|  null|         36|                 5|        133750|
+-------+----+----------+------+-----------+------------------+--------------+